tests/performance/load-test.yml
config:
  target: 'http://localhost:5173'
  phases:
    - duration: 60
      arrivalRate: 5
    - duration: 120
      arrivalRate: 10
    - duration: 60
      arrivalRate: 15
  defaults:
    headers:
      'Content-Type': 'application/json'
      'User-Agent': 'Artillery Load Test'

scenarios:
  - name: "Homepage Load Test"
    weight: 30
    flow:
      - get:
          url: "/"
      - think: 2
      - get:
          url: "/login"
      - think: 1

  - name: "Authentication Flow Test"
    weight: 40
    flow:
      - get:
          url: "/login"
      - think: 1
      - post:
          url: "/api/auth/login"
          json:
            email: "researcher@researchlab.com"
            password: "researcher123"
          capture:
            - json: "$.token"
              as: "authToken"
      - think: 2
      - get:
          url: "/lab-notebook"
          headers:
            Authorization: "Bearer {{ authToken }}"

  - name: "API Endpoints Test"
    weight: 30
    flow:
      - get:
          url: "/api/health"
      - think: 1
      - post:
          url: "/api/auth/login"
          json:
            email: "researcher@researchlab.com"
            password: "researcher123"
          capture:
            - json: "$.token"
              as: "authToken"
      - think: 1
      - get:
          url: "/api/lab-notebooks"
          headers:
            Authorization: "Bearer {{ authToken }}"
      - think: 2
      - get:
          url: "/api/professional-protocols"
          headers:
            Authorization: "Bearer {{ authToken }}"